CarRentalFiCA/src/jbiasa/CarRentalFiCA.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="CarRentalFiCA"
             xmlns:tns="CarRentalFiCA" xmlns:ns="http://j2ee.netbeans.org/wsdl/CarRentalFi/src/myCarRentalFi" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/CarRentalFi/src/myCarRentalFi" location="../jbiServiceUnits/CarRentalFi/myCarRentalFi.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:myCarRentalFiPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="Reservation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="CarRentalFiCA"/>
            </input>
            <output name="output1">
                <soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="CarRentalFiCA"/>
            </output>
            <fault name="fault1">
                <soap:fault name="fault1" use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="CarRentalFiCA"/>
            </fault>
        </operation>
    </binding>
    <service name="CarRentalFiCAService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/CarRentalFiCAService1/casaPort1"/>
        </port>
    </service>
</definitions>
