CarRentalFiCA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:car="CarRentalFiCA">
  <soapenv:Body>
    <car:Reservation soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <InitialValidationRequest>
        <car:myValidationRequest xsi:type="car:ValidationRequest" xmlns:car="http://xml.netbeans.org/schema/CarRentalFiSchema">
          <idCustomer xsi:type="xsd:int">2</idCustomer>
          <idVehicle xsi:type="xsd:int">2</idVehicle>
        </car:myValidationRequest>
      </InitialValidationRequest>
      <InitialReservationDetails xsi:type="car:ReservationDetails" xmlns:car="http://xml.netbeans.org/schema/CarRentalFiSchema">
        <startDate xsi:type="xsd:date">2024-09-08</startDate>
        <finishDate xsi:type="xsd:date">2024-09-18</finishDate>
        <TdaId xsi:type="xsd:int">1</TdaId>
        <report xsi:type="xsd:string">Prueba con bpel</report>
      </InitialReservationDetails>
    </car:Reservation>
  </soapenv:Body>
</soapenv:Envelope>